১. বাইনারি: 000000 01001 01010 01000 00000 100000
​Opcode: 000000 (0) -> R-Type ইনস্ট্রাকশন।
​rs: 01001 (9) -> $t1
​rt: 01010 (10) -> $t2
​rd: 01000 (8) -> $t0
​shamt: 00000 (0)
​Funct: 100000 (32) -> add অপারেশন।
​Assembly: add $t0, $t1, $t2

​২. বাইনারি: 000000 01000 01001 01011 00000 100010
​Opcode: 000000 (0) -> R-Type ইনস্ট্রাকশন।
​rs: 01000 (8) -> $t0
​rt: 01001 (9) -> $t1
​rd: 01011 (11) -> $t3
​shamt: 00000 (0)
​Funct: 100010 (34) -> sub অপারেশন।
​Assembly: sub $t3, $t0, $t1

​৩. বাইনারি: 000000 10001 10010 10000 00000 100100
​Opcode: 000000 (0) -> R-Type ইনস্ট্রাকশন।
​rs: 10001 (17) -> $s1
​rt: 10010 (18) -> $s2
​rd: 10000 (16) -> $s0
​shamt: 00000 (0)
​Funct: 100100 (36) -> and অপারেশন।
​Assembly: and $s0, $s1, $s2

add $t0, $t1, $t2
sub $t3, $t0, $t1
and $s0, $s1, $s2
