১. বাইনারি: 000000 01001 01010 01000 00000 100000
​Opcode: 000000 (0) -> R-Type।
​Funct: 100000 (32) -> add অপারেশন।
​rs=9 ($t1), rt=10 ($t2), rd=8 ($t0)
​Assembly: add $t0, $t1, $t2

​২. বাইনারি: 000000 01000 01001 01011 00000 100010
​Opcode: 000000 (0) -> R-Type।
​Funct: 100010 (34) -> sub অপারেশন।
​rs=8 ($t0), rt=9 ($t1), rd=11 ($t3)
​Assembly: sub $t3, $t0, $t1

​৩. বাইনারি: 000100 01000 01001 0000000000000011
​Opcode: 000100 (4) -> beq (Branch on Equal) ইনস্ট্রাকশন [I-Type]।
​rs: 01000 (8) -> $t0
​rt: 01001 (9) -> $t1
​Immediate (Offset): 3 (এর মানে শর্ত মিললে এটি বর্তমান PC-র পরের ৩ নম্বর ইনস্ট্রাকশনে জাম্প করবে)।
​Assembly: beq $t0, $t1, Label
